---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils
source: html/f0d27ee7-5627-cdfe-5c18-f2886bb48585.htm
---
# IFCExtrusionCalculatorUtils Members

Calculates the extrusion data from a Revit geometry object.